kd> dt win32k!tagTHREADINFO
   +0x000 pEThread         : Ptr32 _ETHREAD
   +0x004 RefCount         : Uint4B
   +0x008 ptlW32           : Ptr32 _TL
   +0x00c pgdiDcattr       : Ptr32 Void
   +0x010 pgdiBrushAttr    : Ptr32 Void
   +0x014 pUMPDObjs        : Ptr32 Void
   +0x018 pUMPDHeap        : Ptr32 Void
   +0x01c pUMPDObj         : Ptr32 Void
   +0x020 GdiTmpTgoList    : _LIST_ENTRY
   +0x028 pRBRecursionCount : Uint4B
   +0x02c pNonRBRecursionCount : Uint4B
   +0x030 tlSpriteState    : _TLSPRITESTATE
   +0x090 pSpriteState     : Ptr32 Void
   +0x094 pDevHTInfo       : Ptr32 Void
   +0x098 ulDevHTInfoUniqueness : Uint4B
   +0x09c pdcoAA           : Ptr32 Void
   +0x0a0 pdcoRender       : Ptr32 Void
   +0x0a4 pdcoSrc          : Ptr32 Void
   +0x0a8 bEnableEngUpdateDeviceSurface : UChar
   +0x0a9 bIncludeSprites  : UChar
   +0x0ac ulWindowSystemRendering : Uint4B
   +0x0b0 iVisRgnUniqueness : Uint4B
   +0x0b4 ptl              : Ptr32 _TL
   +0x0b8 ppi              : Ptr32 tagPROCESSINFO
   +0x0bc pq               : Ptr32 tagQ
   +0x0c0 spklActive       : Ptr32 tagKL
   +0x0c4 pcti             : Ptr32 tagCLIENTTHREADINFO
   +0x0c8 rpdesk           : Ptr32 tagDESKTOP
   +0x0cc pDeskInfo        : Ptr32 tagDESKTOPINFO
   +0x0d0 ulClientDelta    : Uint4B
   +0x0d4 pClientInfo      : Ptr32 tagCLIENTINFO
   +0x0d8 TIF_flags        : Uint4B
   +0x0dc pstrAppName      : Ptr32 _UNICODE_STRING
   +0x0e0 psmsSent         : Ptr32 tagSMS
   +0x0e4 psmsCurrent      : Ptr32 tagSMS
   +0x0e8 psmsReceiveList  : Ptr32 tagSMS
   +0x0ec timeLast         : Int4B
   +0x0f0 idLast           : Uint4B
   +0x0f4 exitCode         : Int4B
   +0x0f8 hdesk            : Ptr32 HDESK__
   +0x0fc cPaintsReady     : Int4B
   +0x100 cTimersReady     : Uint4B
   +0x104 pMenuState       : Ptr32 tagMENUSTATE
   +0x108 ptdb             : Ptr32 tagTDB
   +0x108 pwinsta          : Ptr32 tagWINDOWSTATION
   +0x10c psiiList         : Ptr32 tagSVR_INSTANCE_INFO
   +0x110 dwExpWinVer      : Uint4B
   +0x114 dwCompatFlags    : Uint4B
   +0x114 IgnoreNoDiscard  : Pos 0, 1 Bit
   +0x114 ForceTextBand    : Pos 1, 1 Bit
   +0x114 UsePrintingEscape : Pos 2, 1 Bit
   +0x114 IgnoreTopMost    : Pos 3, 1 Bit
   +0x114 CallTTDevice     : Pos 4, 1 Bit
   +0x114 MultipleBands    : Pos 5, 1 Bit
   +0x114 AlwaysSendSyncPaint : Pos 6, 1 Bit
   +0x114 EditSetTextMunge : Pos 7, 1 Bit
   +0x114 MoreExtraWndWords : Pos 8, 1 Bit
   +0x114 TTIgnoreRasterDupe : Pos 9, 1 Bit
   +0x114 HackWinFlags     : Pos 10, 1 Bit
   +0x114 DealyHwndShakeChk : Pos 11, 1 Bit
   +0x114 EnumHelv         : Pos 12, 1 Bit
   +0x114 EnumTTNotDevice  : Pos 13, 1 Bit
   +0x114 SubtractClips    : Pos 14, 1 Bit
   +0x114 ForceTTGrapchis  : Pos 15, 1 Bit
   +0x114 NoHRGN1          : Pos 16, 1 Bit
   +0x114 NcCalcSizeOnMove : Pos 17, 1 Bit
   +0x114 SendMnuDblClk    : Pos 18, 1 Bit
   +0x114 Win30AvgWidth    : Pos 19, 1 Bit
   +0x114 GetDeviceCaps    : Pos 20, 1 Bit
   +0x114 Winver31         : Pos 21, 1 Bit
   +0x114 IncreaseStack    : Pos 22, 1 Bit
   +0x114 Win31DevModeSize : Pos 23, 1 Bit
   +0x114 DisableFontAssoc : Pos 24, 1 Bit
   +0x114 IgnoreFaults     : Pos 25, 1 Bit
   +0x114 NoEMFSpooling    : Pos 26, 1 Bit
   +0x114 Random31Ux       : Pos 27, 1 Bit
   +0x114 DontJournalAttach : Pos 28, 1 Bit
   +0x114 DisableDBCSProp  : Pos 29, 1 Bit
   +0x114 SmoothScrolling  : Pos 30, 1 Bit
   +0x114 NoScrollBarCtxMenu : Pos 31, 1 Bit
   +0x118 dwCompatFlags2   : Uint4B
   +0x118 qwCompatFlags2   : Uint8B
   +0x118 AnimationOff     : Pos 0, 1 Bit
   +0x118 KCOff            : Pos 1, 1 Bit
   +0x118 No50ExStyles     : Pos 2, 1 Bit
   +0x118 NoDrawPatRect    : Pos 3, 1 Bit
   +0x118 MsShellDlg       : Pos 4, 1 Bit
   +0x118 NoDDETrackDying  : Pos 5, 1 Bit
   +0x118 GiveUpForegound  : Pos 6, 1 Bit
   +0x118 ActiveMenus      : Pos 7, 1 Bit
   +0x118 EditNoMouseHide  : Pos 8, 1 Bit
   +0x118 NoBatching       : Pos 9, 1 Bit
   +0x118 FontSubs         : Pos 10, 1 Bit
   +0x118 No50ExStyleBits  : Pos 11, 1 Bit
   +0x118 NoCustomPaperSize : Pos 12, 1 Bit
   +0x118 DDE              : Pos 13, 1 Bit
   +0x118 DefaultCharset   : Pos 14, 1 Bit
   +0x118 NoCharDeadKey    : Pos 15, 1 Bit
   +0x118 TryExceptCallWndProc : Pos 16, 1 Bit
   +0x118 NoInitFlagsOnFocus : Pos 17, 1 Bit
   +0x118 DDENoSync        : Pos 18, 1 Bit
   +0x118 NoGhost          : Pos 19, 1 Bit
   +0x118 DDENoAsyncReg    : Pos 20, 1 Bit
   +0x118 StrictLLHook     : Pos 21, 1 Bit
   +0x118 NoShadow         : Pos 22, 1 Bit
   +0x118 ForceFusion      : Pos 23, 1 Bit
   +0x118 NoTimeCbProtect  : Pos 24, 1 Bit
   +0x118 DpiAware         : Pos 25, 1 Bit
   +0x118 OpenGLEMF        : Pos 26, 1 Bit
   +0x118 TransparentBltMirror : Pos 27, 1 Bit
   +0x118 NoPaddedBorder   : Pos 28, 1 Bit
   +0x118 ForceLegacyResizeNCMetr : Pos 29, 1 Bit
   +0x118 HardwareMixer    : Pos 30, 1 Bit
   +0x118 NoSoftCursOnMoveSize : Pos 31, 1 Bit
   +0x118 NoWindowArrangement : Pos 32, 1 Bit
   +0x118 SpareCompatFlags2 : Pos 33, 31 Bits
   +0x120 pqAttach         : Ptr32 tagQ
   +0x124 ptiSibling       : Ptr32 tagTHREADINFO
   +0x128 pmsd             : Ptr32 _MOVESIZEDATA
   +0x12c fsHooks          : Uint4B
   +0x130 sphkCurrent      : Ptr32 tagHOOK
   +0x134 lParamHkCurrent  : Int4B
   +0x138 wParamHkCurrent  : Uint4B
   +0x13c pSBTrack         : Ptr32 tagSBTRACK
   +0x140 hEventQueueClient : Ptr32 Void
   +0x144 pEventQueueServer : Ptr32 _KEVENT
   +0x148 PtiLink          : _LIST_ENTRY
   +0x150 iCursorLevel     : Int4B
   +0x154 ptLast           : tagPOINT
   +0x15c ptLastReal       : tagPOINT
   +0x164 spwndDefaultIme  : Ptr32 tagWND
   +0x168 spDefaultImc     : Ptr32 tagIMC
   +0x16c hklPrev          : Ptr32 HKL__
   +0x170 cEnterCount      : Int4B
   +0x174 mlPost           : tagMLIST
   +0x180 fsChangeBitsRemoved : Uint2B
   +0x182 wchInjected      : Wchar
   +0x184 fsReserveKeys    : Uint4B
   +0x188 apEvent          : Ptr32 Ptr32 _KEVENT
   +0x18c amdesk           : Uint4B
   +0x190 cWindows         : Uint4B
   +0x194 cVisWindows      : Uint4B
   +0x198 aphkStart        : [16] Ptr32 tagHOOK
   +0x1d8 cti              : tagCLIENTTHREADINFO
   +0x1e8 hPrevHidData     : Ptr32 Void
   +0x1ec hTouchInputCurrent : Ptr32 HTOUCHINPUT__
   +0x1f0 hGestureInfoCurrent : Ptr32 HGESTUREINFO__
   +0x1f4 MsgPPInfo        : tagMSGPPINFO
   +0x1f8 cNestedStableVisRgn : Uint4B
   +0x1fc readyHead        : _LIST_ENTRY
   +0x204 fSpecialInitialization : Pos 0, 1 Bit
   +0x204 fgfSwitchInProgressSetter : Pos 1, 1 Bit
   +0x204 fPack            : Pos 2, 26 Bits
   +0x204 fThreadCleanupFinished : Pos 28, 1 Bit
   +0x204 fETWReserved     : Pos 29, 3 Bits
   +0x204 ulThreadFlags2   : Uint4B
   
   
kd> dt win32k!tagPOPUPMENU
   +0x000 fIsMenuBar       : Pos 0, 1 Bit
   +0x000 fHasMenuBar      : Pos 1, 1 Bit
   +0x000 fIsSysMenu       : Pos 2, 1 Bit
   +0x000 fIsTrackPopup    : Pos 3, 1 Bit
   +0x000 fDroppedLeft     : Pos 4, 1 Bit
   +0x000 fHierarchyDropped : Pos 5, 1 Bit
   +0x000 fRightButton     : Pos 6, 1 Bit
   +0x000 fToggle          : Pos 7, 1 Bit
   +0x000 fSynchronous     : Pos 8, 1 Bit
   +0x000 fFirstClick      : Pos 9, 1 Bit
   +0x000 fDropNextPopup   : Pos 10, 1 Bit
   +0x000 fNoNotify        : Pos 11, 1 Bit
   +0x000 fAboutToHide     : Pos 12, 1 Bit
   +0x000 fShowTimer       : Pos 13, 1 Bit
   +0x000 fHideTimer       : Pos 14, 1 Bit
   +0x000 fDestroyed       : Pos 15, 1 Bit
   +0x000 fDelayedFree     : Pos 16, 1 Bit
   +0x000 fFlushDelayedFree : Pos 17, 1 Bit
   +0x000 fFreed           : Pos 18, 1 Bit
   +0x000 fInCancel        : Pos 19, 1 Bit
   +0x000 fTrackMouseEvent : Pos 20, 1 Bit
   +0x000 fSendUninit      : Pos 21, 1 Bit
   +0x000 fRtoL            : Pos 22, 1 Bit
   +0x000 iDropDir         : Pos 23, 5 Bits
   +0x000 fUseMonitorRect  : Pos 28, 1 Bit
   +0x004 spwndNotify      : Ptr32 tagWND
   +0x008 spwndPopupMenu   : Ptr32 tagWND
   +0x00c spwndNextPopup   : Ptr32 tagWND
   +0x010 spwndPrevPopup   : Ptr32 tagWND
   +0x014 spmenu           : Ptr32 tagMENU
   +0x018 spmenuAlternate  : Ptr32 tagMENU
   +0x01c spwndActivePopup : Ptr32 tagWND
   +0x020 ppopupmenuRoot   : Ptr32 tagPOPUPMENU
   +0x024 ppmDelayedFree   : Ptr32 tagPOPUPMENU
   +0x028 posSelectedItem  : Uint4B
   +0x02c posDropped       : Uint4B
   
   
kd> dt win32k!tagMENU
   +0x000 head             : _PROCDESKHEAD
   +0x014 fFlags           : Uint4B
   +0x018 iItem            : Int4B
   +0x01c cAlloced         : Uint4B
   +0x020 cItems           : Uint4B
   +0x024 cxMenu           : Uint4B
   +0x028 cyMenu           : Uint4B
   +0x02c cxTextAlign      : Uint4B
   +0x030 spwndNotify      : Ptr32 tagWND
   +0x034 rgItems          : Ptr32 tagITEM
   +0x038 pParentMenus     : Ptr32 tagMENULIST
   +0x03c dwContextHelpId  : Uint4B
   +0x040 cyMax            : Uint4B
   +0x044 dwMenuData       : Uint4B
   +0x048 hbrBack          : Ptr32 HBRUSH__
   +0x04c iTop             : Int4B
   +0x050 iMaxTop          : Int4B
   +0x054 dwArrowsOn       : Pos 0, 2 Bits
   +0x058 umpm             : tagUAHMENUPOPUPMETRICS
   
   
kd> dt win32k!tagMENUSTATE
   +0x000 pGlobalPopupMenu : Ptr32 tagPOPUPMENU
   +0x004 fMenuStarted     : Pos 0, 1 Bit
   +0x004 fIsSysMenu       : Pos 1, 1 Bit
   +0x004 fInsideMenuLoop  : Pos 2, 1 Bit
   +0x004 fButtonDown      : Pos 3, 1 Bit
   +0x004 fInEndMenu       : Pos 4, 1 Bit
   +0x004 fUnderline       : Pos 5, 1 Bit
   +0x004 fButtonAlwaysDown : Pos 6, 1 Bit
   +0x004 fDragging        : Pos 7, 1 Bit
   +0x004 fModelessMenu    : Pos 8, 1 Bit
   +0x004 fInCallHandleMenuMessages : Pos 9, 1 Bit
   +0x004 fDragAndDrop     : Pos 10, 1 Bit
   +0x004 fAutoDismiss     : Pos 11, 1 Bit
   +0x004 fAboutToAutoDismiss : Pos 12, 1 Bit
   +0x004 fIgnoreButtonUp  : Pos 13, 1 Bit
   +0x004 fMouseOffMenu    : Pos 14, 1 Bit
   +0x004 fInDoDragDrop    : Pos 15, 1 Bit
   +0x004 fActiveNoForeground : Pos 16, 1 Bit
   +0x004 fNotifyByPos     : Pos 17, 1 Bit
   +0x004 fSetCapture      : Pos 18, 1 Bit
   +0x004 iAniDropDir      : Pos 19, 5 Bits
   +0x008 ptMouseLast      : tagPOINT
   +0x010 mnFocus          : Int4B
   +0x014 cmdLast          : Int4B
   +0x018 ptiMenuStateOwner : Ptr32 tagTHREADINFO
   +0x01c dwLockCount      : Uint4B
   +0x020 pmnsPrev         : Ptr32 tagMENUSTATE
   +0x024 ptButtonDown     : tagPOINT
   +0x02c uButtonDownHitArea : Uint4B
   +0x030 uButtonDownIndex : Uint4B
   +0x034 vkButtonDown     : Int4B
   +0x038 uDraggingHitArea : Uint4B
   +0x03c uDraggingIndex   : Uint4B
   +0x040 uDraggingFlags   : Uint4B
   +0x044 hdcWndAni        : Ptr32 HDC__
   +0x048 dwAniStartTime   : Uint4B
   +0x04c ixAni            : Int4B
   +0x050 iyAni            : Int4B
   +0x054 cxAni            : Int4B
   +0x058 cyAni            : Int4B
   +0x05c hbmAni           : Ptr32 HBITMAP__
   +0x060 hdcAni           : Ptr32 HDC__
