flow:
91dddb11 win32k!EngFntCacheAlloc BF99DB11 offset 2DBC0000
NtUserSetClassLong(hWnd, index, dNewLong) 91c748bb
	ValidateHwnd() 91d1eb10 BF8DEB10
	xxxSetClassLong 91c74a08
	xxxSetClassData 91c775d5
	xxxSetClassCursor 91d658aa
	xxxSetClassIcon 91d5b328 BF91B328
		HMAssignmentLock 91d0c99b BF8CC99B
		xxxCreateClassSmIcon 91cde9f4 BF89E9F4
		xxxClientCopyImage 91ce3326 BF8A3326
			win32k!_imp__KeUserModeCallback 91e2f478
		HMAssignmentLock
			HMUnlockObject 91d0c556 BF8CC556
	
	
xxxDestroyWindow 91ce0915 BF8A0915
	xxxFreeWindow 91ce0021 BF8A0021
		DereferenceClass 91cdf3eb BF89F3EB
		HMMarkObjectDestroy 91d0c466 BF8CC466
		
		
object in xxxCreateClassSmIcon fea19998

handle of current process 0xfea19ad8

kd> dt win32k!tagCLS fea19998
   +0x000 pclsNext         : (null) 
   +0x004 atomClassName    : 0xc236
   +0x006 atomNVClassName  : 0xc236
   +0x008 fnid             : 0
   +0x00c rpdeskParent     : 0x86a22618 tagDESKTOP
   +0x010 pdce             : (null) 
   +0x014 hTaskWow         : 0
   +0x016 CSF_flags        : 0xc0
   +0x018 lpszClientAnsiMenuName : (null) 
   +0x01c lpszClientUnicodeMenuName : (null) 
   +0x020 spcpdFirst       : (null) 
   +0x024 pclsBase         : 0xfea19998 tagCLS
   +0x028 pclsClone        : (null) 
   +0x02c cWndReferenceCount : 0n1
   +0x030 style            : 0
   +0x034 lpfnWndProc      : 0x00411154     long  +411154
   +0x038 cbclsExtra       : 0n0
   +0x03c cbwndExtra       : 0n0
   +0x040 hModule          : 0x00400000 Void
   +0x044 spicn            : 0xffb8f270 tagCURSOR
   +0x048 spcur            : (null) 
   +0x04c hbrBackground    : (null) 
   +0x050 lpszMenuName     : (null) 
   +0x054 lpszAnsiClassName : 0xfea19a38  "usercls348_Mainwindow"
   +0x058 spicnSm          : (null) 

kd> dt win32k!tagCURSOR
   +0x000 head             : _PROCMARKHEAD
   +0x010 pcurNext         : Ptr32 tagCURSOR
   +0x014 strName          : _UNICODE_STRING
   +0x01c atomModName      : Uint2B
   +0x01e rt               : Uint2B
   +0x020 CURSORF_flags    : Uint4B
   +0x024 xHotspot         : Int2B
   +0x026 yHotspot         : Int2B
   +0x028 hbmMask          : Ptr32 HBITMAP__
   +0x02c hbmColor         : Ptr32 HBITMAP__
   +0x030 hbmAlpha         : Ptr32 HBITMAP__
   +0x034 rcBounds         : tagRECT
   +0x044 hbmUserAlpha     : Ptr32 HBITMAP__
   +0x048 bpp              : Uint4B
   +0x04c cx               : Uint4B
   +0x050 cy               : Uint4B
   
kd> dt win32k!_PROCMARKHEAD
   +0x000 h                : Ptr32 Void
   +0x004 cLockObj         : Uint4B
   +0x008 hTaskWow         : Uint4B
   +0x00c ppi              : Ptr32 tagPROCESSINFO
   
kd> dt win32k!tagSHAREDINFO
   +0x000 psi              : Ptr32 tagSERVERINFO
   +0x004 aheList          : Ptr32 _HANDLEENTRY
   +0x008 HeEntrySize      : Uint4B
   +0x00c pDispInfo        : Ptr32 tagDISPLAYINFO
   +0x010 ulSharedDelta    : Uint4B
   +0x014 awmControl       : [31] _WNDMSG
   +0x10c DefWindowMsgs    : _WNDMSG
   +0x114 DefWindowSpecMsgs : _WNDMSG
   
kd> dt win32k!_HANDLEENTRY
   +0x000 phead            : Ptr32 _HEAD
   +0x004 pOwner           : Ptr32 Void
   +0x008 bType            : UChar
   +0x009 bFlags           : UChar
   +0x00a wUniq            : Uint2B
   
kd> dt win32k!tagPROPLIST
   +0x000 cEntries         : Uint4B
   +0x004 iFirstFree       : Uint4B
   +0x008 aprop            : [1] tagPROP
   
kd> dt win32k!tagPROP
   +0x000 hData            : Ptr32 Void
   +0x004 atomKey          : Uint2B
   +0x006 fs               : Uint2B
   
kd> dt win32k!_THRDESKHEAD
   +0x000 h                : Ptr32 Void
   +0x004 cLockObj         : Uint4B
   +0x008 pti              : Ptr32 tagTHREADINFO
   +0x00c rpdesk           : Ptr32 tagDESKTOP
   +0x010 pSelf            : Ptr32 UChar
   
kd> dt win32k!tagWND fea19ad8
   +0x000 head             : _THRDESKHEAD
   +0x014 state            : 0x40000010
   +0x014 bHasMeun         : 0y0
   +0x014 bHasVerticalScrollbar : 0y0
   +0x014 bHasHorizontalScrollbar : 0y0
   +0x014 bHasCaption      : 0y0
   +0x014 bSendSizeMoveMsgs : 0y1
   +0x014 bMsgBox          : 0y0
   +0x014 bActiveFrame     : 0y0
   +0x014 bHasSPB          : 0y0
   +0x014 bNoNCPaint       : 0y0
   +0x014 bSendEraseBackground : 0y0
   +0x014 bEraseBackground : 0y0
   +0x014 bSendNCPaint     : 0y0
   +0x014 bInternalPaint   : 0y0
   +0x014 bUpdateDirty     : 0y0
   +0x014 bHiddenPopup     : 0y0
   +0x014 bForceMenuDraw   : 0y0
   +0x014 bDialogWindow    : 0y0
   +0x014 bHasCreatestructName : 0y0
   +0x014 bServerSideWindowProc : 0y0
   +0x014 bAnsiWindowProc  : 0y0
   +0x014 bBeingActivated  : 0y0
   +0x014 bHasPalette      : 0y0
   +0x014 bPaintNotProcessed : 0y0
   +0x014 bSyncPaintPending : 0y0
   +0x014 bRecievedQuerySuspendMsg : 0y0
   +0x014 bRecievedSuspendMsg : 0y0
   +0x014 bToggleTopmost   : 0y0
   +0x014 bRedrawIfHung    : 0y0
   +0x014 bRedrawFrameIfHung : 0y0
   +0x014 bAnsiCreator     : 0y0
   +0x014 bMaximizesToMonitor : 0y1
   +0x014 bDestroyed       : 0y0
   +0x018 state2           : 0x80000700
   +0x018 bWMPaintSent     : 0y0
   +0x018 bEndPaintInvalidate : 0y0
   +0x018 bStartPaint      : 0y0
   +0x018 bOldUI           : 0y0
   +0x018 bHasClientEdge   : 0y0
   +0x018 bBottomMost      : 0y0
   +0x018 bFullScreen      : 0y0
   +0x018 bInDestroy       : 0y0
   +0x018 bWin31Compat     : 0y1
   +0x018 bWin40Compat     : 0y1
   +0x018 bWin50Compat     : 0y1
   +0x018 bMaximizeMonitorRegion : 0y0
   +0x018 bCloseButtonDown : 0y0
   +0x018 bMaximizeButtonDown : 0y0
   +0x018 bMinimizeButtonDown : 0y0
   +0x018 bHelpButtonDown  : 0y0
   +0x018 bScrollBarLineUpBtnDown : 0y0
   +0x018 bScrollBarPageUpBtnDown : 0y0
   +0x018 bScrollBarPageDownBtnDown : 0y0
   +0x018 bScrollBarLineDownBtnDown : 0y0
   +0x018 bAnyScrollButtonDown : 0y0
   +0x018 bScrollBarVerticalTracking : 0y0
   +0x018 bForceNCPaint    : 0y0
   +0x018 bForceFullNCPaintClipRgn : 0y0
   +0x018 FullScreenMode   : 0y000
   +0x018 bCaptionTextTruncated : 0y0
   +0x018 bNoMinmaxAnimatedRects : 0y0
   +0x018 bSmallIconFromWMQueryDrag : 0y0
   +0x018 bShellHookRegistered : 0y0
   +0x018 bWMCreateMsgProcessed : 0y1
   +0x01c ExStyle          : 0x100
   +0x01c bWS_EX_DLGMODALFRAME : 0y0
   +0x01c bUnused1         : 0y0
   +0x01c bWS_EX_NOPARENTNOTIFY : 0y0
   +0x01c bWS_EX_TOPMOST   : 0y0
   +0x01c bWS_EX_ACCEPTFILE : 0y0
   +0x01c bWS_EX_TRANSPARENT : 0y0
   +0x01c bWS_EX_MDICHILD  : 0y0
   +0x01c bWS_EX_TOOLWINDOW : 0y0
   +0x01c bWS_EX_WINDOWEDGE : 0y1
   +0x01c bWS_EX_CLIENTEDGE : 0y0
   +0x01c bWS_EX_CONTEXTHELP : 0y0
   +0x01c bMakeVisibleWhenUnghosted : 0y0
   +0x01c bWS_EX_RIGHT     : 0y0
   +0x01c bWS_EX_RTLREADING : 0y0
   +0x01c bWS_EX_LEFTSCROLLBAR : 0y0
   +0x01c bUnused2         : 0y0
   +0x01c bWS_EX_CONTROLPARENT : 0y0
   +0x01c bWS_EX_STATICEDGE : 0y0
   +0x01c bWS_EX_APPWINDOW : 0y0
   +0x01c bWS_EX_LAYERED   : 0y0
   +0x01c bWS_EX_NOINHERITLAYOUT : 0y0
   +0x01c bUnused3         : 0y0
   +0x01c bWS_EX_LAYOUTRTL : 0y0
   +0x01c bWS_EX_NOPADDEDBORDER : 0y0
   +0x01c bUnused4         : 0y0
   +0x01c bWS_EX_COMPOSITED : 0y0
   +0x01c bUIStateActive   : 0y0
   +0x01c bWS_EX_NOACTIVATE : 0y0
   +0x01c bWS_EX_COMPOSITEDCompositing : 0y0
   +0x01c bRedirected      : 0y0
   +0x01c bUIStateKbdAccelHidden : 0y0
   +0x01c bUIStateFocusRectHidden : 0y0
   +0x020 style            : 0x24c00000
   +0x020 bReserved1       : 0y0000000000000000 (0)
   +0x020 bWS_MAXIMIZEBOX  : 0y0
   +0x020 bReserved2       : 0y0000000000000000 (0)
   +0x020 bWS_TABSTOP      : 0y0
   +0x020 bReserved3       : 0y0000000000000000 (0)
   +0x020 bUnused5         : 0y0
   +0x020 bWS_MINIMIZEBOX  : 0y0
   +0x020 bReserved4       : 0y0000000000000000 (0)
   +0x020 bUnused6         : 0y0
   +0x020 bWS_GROUP        : 0y0
   +0x020 bReserved5       : 0y0000000000000000 (0)
   +0x020 bUnused7         : 0y00
   +0x020 bWS_THICKFRAME   : 0y0
   +0x020 bReserved6       : 0y0000000000000000 (0)
   +0x020 bUnused8         : 0y00
   +0x020 bWS_SIZEBOX      : 0y0
   +0x020 bReserved7       : 0y0000000000000000 (0)
   +0x020 bUnused9         : 0y000
   +0x020 bWS_SYSMENU      : 0y0
   +0x020 bWS_HSCROLL      : 0y0
   +0x020 bWS_VSCROLL      : 0y0
   +0x020 bWS_DLGFRAME     : 0y1
   +0x020 bWS_BORDER       : 0y1
   +0x020 bMaximized       : 0y0
   +0x020 bWS_CLIPCHILDREN : 0y0
   +0x020 bWS_CLIPSIBLINGS : 0y1
   +0x020 bDisabled        : 0y0
   +0x020 bVisible         : 0y0
   +0x020 bMinimized       : 0y1
   +0x020 bWS_CHILD        : 0y0
   +0x020 bWS_POPUP        : 0y0
   +0x024 hModule          : 0x00400000 Void
   +0x028 hMod16           : 0
   +0x02a fnid             : 0
   +0x02c spwndNext        : 0xfea07bd8 tagWND
   +0x030 spwndPrev        : 0xfea19bb0 tagWND
   +0x034 spwndParent      : 0xfea00618 tagWND
   +0x038 spwndChild       : (null) 
   +0x03c spwndOwner       : (null) 
   +0x040 rcWindow         : tagRECT
   +0x050 rcClient         : tagRECT
   +0x060 lpfnWndProc      : 0x00411154     long  +411154
   +0x064 pcls             : 0xfea19998 tagCLS
   +0x068 hrgnUpdate       : (null) 
   +0x06c ppropList        : 0xfea19288 tagPROPLIST
   +0x070 pSBInfo          : (null) 
   +0x074 spmenuSys        : (null) 
   +0x078 spmenu           : (null) 
   +0x07c hrgnClip         : (null) 
   +0x080 hrgnNewFrame     : (null) 
   +0x084 strName          : _LARGE_UNICODE_STRING
   +0x090 cbwndExtra       : 0n0
   +0x094 spwndLastActive  : 0xfea19ad8 tagWND
   +0x098 hImc             : 0x010001fb HIMC__
   +0x09c dwUserData       : 0
   +0x0a0 pActCtx          : (null) 
   +0x0a4 pTransform       : (null) 
   +0x0a8 spwndClipboardListenerNext : (null) 
   +0x0ac ExStyle2         : 8
   +0x0ac bClipboardListener : 0y0
   +0x0ac bLayeredInvalidate : 0y0
   +0x0ac bRedirectedForPrint : 0y0
   +0x0ac bLinked          : 0y1
   +0x0ac bLayeredForDWM   : 0y0
   +0x0ac bLayeredLimbo    : 0y0
   +0x0ac bHIGHDPI_UNAWARE_Unused : 0y0
   +0x0ac bVerticallyMaximizedLeft : 0y0
   +0x0ac bVerticallyMaximizedRight : 0y0
   +0x0ac bHasOverlay      : 0y0
   +0x0ac bConsoleWindow   : 0y0
   +0x0ac bChildNoActivate : 0y0

   
ff910000  00000000 00000000 00010000 ff9d1d28
ff910010  00000000 0001000c ffbbd498 ffb1c008
ff910020  00014001 ffb8f5c8 ffbbc958 00010003
ff910030  ff7d0618 ffb1c008 00010001 ffb93a68
