remote debug windows 7
srv*E:\symbols*http://msdl.microsoft.com/download/symbols

set enviroment path: _NT_SYMBOL_PROXY http://192.168.5.8:3128

bcdedit /debug on
bcdedit /dbgsettings serial debugport:2 baudrate:115200

\\.\pipe\com_1

kd_Clone_of_Windows_7_-_fuzzing
cjComputeGLYPHSET_MSFT_GENERAL

net stop wuauserv
net stop bits

C:\Windows\SoftwareDistribution

net start wuauserv
net start bits


set bp in win32k

!process 0 0 fontview.exe
.process <PROCESS>

!sym noisy
#.reload win32k.sys
!lmi win32k
bp win32k!<symbol>

ba e1 nt!KeUserModeCallback
ba e1 win32k!xxxNextWindow+0x3c9
ba e1 win32k!xxxNextWindow+3d0
dt win32k!tagWND xxx pcls bServerSideWindowProc

80000700 20080900
fea1f968 94c80000 00000000

x win32k!*

dt nt!_ETHEAD

dt win32k!_SHAREDINFO
dt win32k!tagWND
dt nt!_EPROCESS
dt nt!_TOKEN_TYPE


dd win32k!gSharedInfo _HANDLEENTRY
dt win32k!tagSHAREDINFO
dt win32k!tagSHAREDINFO [_HANDLEENTRY]  + (sizeofentry)c * (WORD)(hwnd)
dt win32k!tagWND addr
dt win32k!tagWND fea25750 bWS_CHILD spmenu

Privs: 
 19 0x000000013 SeShutdownPrivilege               Attributes - 
 23 0x000000017 SeChangeNotifyPrivilege           Attributes - Enabled Default 
 25 0x000000019 SeUndockPrivilege                 Attributes - 
 33 0x000000021 SeIncreaseWorkingSetPrivilege     Attributes - 
 34 0x000000022 SeTimeZonePrivilege               Attributes - 

Privs: 
 19 0x000000013 SeShutdownPrivilege               Attributes - Enabled 
 23 0x000000017 SeChangeNotifyPrivilege           Attributes - Enabled Default 
 25 0x000000019 SeUndockPrivilege                 Attributes - Enabled 
 33 0x000000021 SeIncreaseWorkingSetPrivilege     Attributes - Enabled 
 34 0x000000022 SeTimeZonePrivilege               Attributes - Enabled 
 
Privs: 
 02 0x000000002 SeCreateTokenPrivilege            Attributes - 
 03 0x000000003 SeAssignPrimaryTokenPrivilege     Attributes - 
 04 0x000000004 SeLockMemoryPrivilege             Attributes - Enabled Default 
 05 0x000000005 SeIncreaseQuotaPrivilege          Attributes - 
 07 0x000000007 SeTcbPrivilege                    Attributes - Enabled Default 
 08 0x000000008 SeSecurityPrivilege               Attributes - 
 09 0x000000009 SeTakeOwnershipPrivilege          Attributes - 
 10 0x00000000a SeLoadDriverPrivilege             Attributes - 
 11 0x00000000b SeSystemProfilePrivilege          Attributes - Enabled Default 
 12 0x00000000c SeSystemtimePrivilege             Attributes - 
 13 0x00000000d SeProfileSingleProcessPrivilege   Attributes - Enabled Default 
 14 0x00000000e SeIncreaseBasePriorityPrivilege   Attributes - Enabled Default 
 15 0x00000000f SeCreatePagefilePrivilege         Attributes - Enabled Default 
 16 0x000000010 SeCreatePermanentPrivilege        Attributes - Enabled Default 
 17 0x000000011 SeBackupPrivilege                 Attributes - 
 18 0x000000012 SeRestorePrivilege                Attributes - 
 19 0x000000013 SeShutdownPrivilege               Attributes - 
 20 0x000000014 SeDebugPrivilege                  Attributes - Enabled Default 
 21 0x000000015 SeAuditPrivilege                  Attributes - Enabled Default 
 22 0x000000016 SeSystemEnvironmentPrivilege      Attributes - 
 23 0x000000017 SeChangeNotifyPrivilege           Attributes - Enabled Default 
 25 0x000000019 SeUndockPrivilege                 Attributes - 
 28 0x00000001c SeManageVolumePrivilege           Attributes - 
 29 0x00000001d SeImpersonatePrivilege            Attributes - Enabled Default 
 30 0x00000001e SeCreateGlobalPrivilege           Attributes - Enabled Default 
 31 0x00000001f SeTrustedCredManAccessPrivilege   Attributes - 
 32 0x000000020 SeRelabelPrivilege                Attributes - 
 33 0x000000021 SeIncreaseWorkingSetPrivilege     Attributes - Enabled Default 
 34 0x000000022 SeTimeZonePrivilege               Attributes - Enabled Default 
 35 0x000000023 SeCreateSymbolicLinkPrivilege     Attributes - Enabled Default 

 
 kd> dt win32k!tagWND
   +0x000 head             : _THRDESKHEAD
   +0x014 state            : Uint4B
   +0x014 bHasMeun         : Pos 0, 1 Bit
   +0x014 bHasVerticalScrollbar : Pos 1, 1 Bit
   +0x014 bHasHorizontalScrollbar : Pos 2, 1 Bit
   +0x014 bHasCaption      : Pos 3, 1 Bit
   +0x014 bSendSizeMoveMsgs : Pos 4, 1 Bit
   +0x014 bMsgBox          : Pos 5, 1 Bit
   +0x014 bActiveFrame     : Pos 6, 1 Bit
   +0x014 bHasSPB          : Pos 7, 1 Bit
   +0x014 bNoNCPaint       : Pos 8, 1 Bit
   +0x014 bSendEraseBackground : Pos 9, 1 Bit
   +0x014 bEraseBackground : Pos 10, 1 Bit
   +0x014 bSendNCPaint     : Pos 11, 1 Bit
   +0x014 bInternalPaint   : Pos 12, 1 Bit
   +0x014 bUpdateDirty     : Pos 13, 1 Bit
   +0x014 bHiddenPopup     : Pos 14, 1 Bit
   +0x014 bForceMenuDraw   : Pos 15, 1 Bit
   +0x014 bDialogWindow    : Pos 16, 1 Bit
   +0x014 bHasCreatestructName : Pos 17, 1 Bit
   +0x014 bServerSideWindowProc : Pos 18, 1 Bit
   +0x014 bAnsiWindowProc  : Pos 19, 1 Bit
   +0x014 bBeingActivated  : Pos 20, 1 Bit
   +0x014 bHasPalette      : Pos 21, 1 Bit
   +0x014 bPaintNotProcessed : Pos 22, 1 Bit
   +0x014 bSyncPaintPending : Pos 23, 1 Bit
   +0x014 bRecievedQuerySuspendMsg : Pos 24, 1 Bit
   +0x014 bRecievedSuspendMsg : Pos 25, 1 Bit
   +0x014 bToggleTopmost   : Pos 26, 1 Bit
   +0x014 bRedrawIfHung    : Pos 27, 1 Bit
   +0x014 bRedrawFrameIfHung : Pos 28, 1 Bit
   +0x014 bAnsiCreator     : Pos 29, 1 Bit
   +0x014 bMaximizesToMonitor : Pos 30, 1 Bit
   +0x014 bDestroyed       : Pos 31, 1 Bit
   +0x018 state2           : Uint4B
   +0x018 bWMPaintSent     : Pos 0, 1 Bit
   +0x018 bEndPaintInvalidate : Pos 1, 1 Bit
   +0x018 bStartPaint      : Pos 2, 1 Bit
   +0x018 bOldUI           : Pos 3, 1 Bit
   +0x018 bHasClientEdge   : Pos 4, 1 Bit
   +0x018 bBottomMost      : Pos 5, 1 Bit
   +0x018 bFullScreen      : Pos 6, 1 Bit
   +0x018 bInDestroy       : Pos 7, 1 Bit
   +0x018 bWin31Compat     : Pos 8, 1 Bit
   +0x018 bWin40Compat     : Pos 9, 1 Bit
   +0x018 bWin50Compat     : Pos 10, 1 Bit
   +0x018 bMaximizeMonitorRegion : Pos 11, 1 Bit
   +0x018 bCloseButtonDown : Pos 12, 1 Bit
   +0x018 bMaximizeButtonDown : Pos 13, 1 Bit
   +0x018 bMinimizeButtonDown : Pos 14, 1 Bit
   +0x018 bHelpButtonDown  : Pos 15, 1 Bit
   +0x018 bScrollBarLineUpBtnDown : Pos 16, 1 Bit
   +0x018 bScrollBarPageUpBtnDown : Pos 17, 1 Bit
   +0x018 bScrollBarPageDownBtnDown : Pos 18, 1 Bit
   +0x018 bScrollBarLineDownBtnDown : Pos 19, 1 Bit
   +0x018 bAnyScrollButtonDown : Pos 20, 1 Bit
   +0x018 bScrollBarVerticalTracking : Pos 21, 1 Bit
   +0x018 bForceNCPaint    : Pos 22, 1 Bit
   +0x018 bForceFullNCPaintClipRgn : Pos 23, 1 Bit
   +0x018 FullScreenMode   : Pos 24, 3 Bits
   +0x018 bCaptionTextTruncated : Pos 27, 1 Bit
   +0x018 bNoMinmaxAnimatedRects : Pos 28, 1 Bit
   +0x018 bSmallIconFromWMQueryDrag : Pos 29, 1 Bit
   +0x018 bShellHookRegistered : Pos 30, 1 Bit
   +0x018 bWMCreateMsgProcessed : Pos 31, 1 Bit
   +0x01c ExStyle          : Uint4B
   +0x01c bWS_EX_DLGMODALFRAME : Pos 0, 1 Bit
   +0x01c bUnused1         : Pos 1, 1 Bit
   +0x01c bWS_EX_NOPARENTNOTIFY : Pos 2, 1 Bit
   +0x01c bWS_EX_TOPMOST   : Pos 3, 1 Bit
   +0x01c bWS_EX_ACCEPTFILE : Pos 4, 1 Bit
   +0x01c bWS_EX_TRANSPARENT : Pos 5, 1 Bit
   +0x01c bWS_EX_MDICHILD  : Pos 6, 1 Bit
   +0x01c bWS_EX_TOOLWINDOW : Pos 7, 1 Bit
   +0x01c bWS_EX_WINDOWEDGE : Pos 8, 1 Bit
   +0x01c bWS_EX_CLIENTEDGE : Pos 9, 1 Bit
   +0x01c bWS_EX_CONTEXTHELP : Pos 10, 1 Bit
   +0x01c bMakeVisibleWhenUnghosted : Pos 11, 1 Bit
   +0x01c bWS_EX_RIGHT     : Pos 12, 1 Bit
   +0x01c bWS_EX_RTLREADING : Pos 13, 1 Bit
   +0x01c bWS_EX_LEFTSCROLLBAR : Pos 14, 1 Bit
   +0x01c bUnused2         : Pos 15, 1 Bit
   +0x01c bWS_EX_CONTROLPARENT : Pos 16, 1 Bit
   +0x01c bWS_EX_STATICEDGE : Pos 17, 1 Bit
   +0x01c bWS_EX_APPWINDOW : Pos 18, 1 Bit
   +0x01c bWS_EX_LAYERED   : Pos 19, 1 Bit
   +0x01c bWS_EX_NOINHERITLAYOUT : Pos 20, 1 Bit
   +0x01c bUnused3         : Pos 21, 1 Bit
   +0x01c bWS_EX_LAYOUTRTL : Pos 22, 1 Bit
   +0x01c bWS_EX_NOPADDEDBORDER : Pos 23, 1 Bit
   +0x01c bUnused4         : Pos 24, 1 Bit
   +0x01c bWS_EX_COMPOSITED : Pos 25, 1 Bit
   +0x01c bUIStateActive   : Pos 26, 1 Bit
   +0x01c bWS_EX_NOACTIVATE : Pos 27, 1 Bit
   +0x01c bWS_EX_COMPOSITEDCompositing : Pos 28, 1 Bit
   +0x01c bRedirected      : Pos 29, 1 Bit
   +0x01c bUIStateKbdAccelHidden : Pos 30, 1 Bit
   +0x01c bUIStateFocusRectHidden : Pos 31, 1 Bit
   +0x020 style            : Uint4B
   +0x020 bReserved1       : Pos 0, 16 Bits
   +0x020 bWS_MAXIMIZEBOX  : Pos 16, 1 Bit
   +0x020 bReserved2       : Pos 0, 16 Bits
   +0x020 bWS_TABSTOP      : Pos 16, 1 Bit
   +0x020 bReserved3       : Pos 0, 16 Bits
   +0x020 bUnused5         : Pos 16, 1 Bit
   +0x020 bWS_MINIMIZEBOX  : Pos 17, 1 Bit
   +0x020 bReserved4       : Pos 0, 16 Bits
   +0x020 bUnused6         : Pos 16, 1 Bit
   +0x020 bWS_GROUP        : Pos 17, 1 Bit
   +0x020 bReserved5       : Pos 0, 16 Bits
   +0x020 bUnused7         : Pos 16, 2 Bits
   +0x020 bWS_THICKFRAME   : Pos 18, 1 Bit
   +0x020 bReserved6       : Pos 0, 16 Bits
   +0x020 bUnused8         : Pos 16, 2 Bits
   +0x020 bWS_SIZEBOX      : Pos 18, 1 Bit
   +0x020 bReserved7       : Pos 0, 16 Bits
   +0x020 bUnused9         : Pos 16, 3 Bits
   +0x020 bWS_SYSMENU      : Pos 19, 1 Bit
   +0x020 bWS_HSCROLL      : Pos 20, 1 Bit
   +0x020 bWS_VSCROLL      : Pos 21, 1 Bit
   +0x020 bWS_DLGFRAME     : Pos 22, 1 Bit
   +0x020 bWS_BORDER       : Pos 23, 1 Bit
   +0x020 bMaximized       : Pos 24, 1 Bit
   +0x020 bWS_CLIPCHILDREN : Pos 25, 1 Bit
   +0x020 bWS_CLIPSIBLINGS : Pos 26, 1 Bit
   +0x020 bDisabled        : Pos 27, 1 Bit
   +0x020 bVisible         : Pos 28, 1 Bit
   +0x020 bMinimized       : Pos 29, 1 Bit
   +0x020 bWS_CHILD        : Pos 30, 1 Bit
   +0x020 bWS_POPUP        : Pos 31, 1 Bit
   +0x024 hModule          : Ptr32 Void
   +0x028 hMod16           : Uint2B
   +0x02a fnid             : Uint2B
   +0x02c spwndNext        : Ptr32 tagWND
   +0x030 spwndPrev        : Ptr32 tagWND
   +0x034 spwndParent      : Ptr32 tagWND
   +0x038 spwndChild       : Ptr32 tagWND
   +0x03c spwndOwner       : Ptr32 tagWND
   +0x040 rcWindow         : tagRECT
   +0x050 rcClient         : tagRECT
   +0x060 lpfnWndProc      : Ptr32     long 
   +0x064 pcls             : Ptr32 tagCLS
   +0x068 hrgnUpdate       : Ptr32 HRGN__
   +0x06c ppropList        : Ptr32 tagPROPLIST
   +0x070 pSBInfo          : Ptr32 tagSBINFO
   +0x074 spmenuSys        : Ptr32 tagMENU
   +0x078 spmenu           : Ptr32 tagMENU
   +0x07c hrgnClip         : Ptr32 HRGN__
   +0x080 hrgnNewFrame     : Ptr32 HRGN__
   +0x084 strName          : _LARGE_UNICODE_STRING
   +0x090 cbwndExtra       : Int4B
   +0x094 spwndLastActive  : Ptr32 tagWND
   +0x098 hImc             : Ptr32 HIMC__
   +0x09c dwUserData       : Uint4B
   +0x0a0 pActCtx          : Ptr32 _ACTIVATION_CONTEXT
   +0x0a4 pTransform       : Ptr32 _D3DMATRIX
   +0x0a8 spwndClipboardListenerNext : Ptr32 tagWND
   +0x0ac ExStyle2         : Uint4B
   +0x0ac bClipboardListener : Pos 0, 1 Bit
   +0x0ac bLayeredInvalidate : Pos 1, 1 Bit
   +0x0ac bRedirectedForPrint : Pos 2, 1 Bit
   +0x0ac bLinked          : Pos 3, 1 Bit
   +0x0ac bLayeredForDWM   : Pos 4, 1 Bit
   +0x0ac bLayeredLimbo    : Pos 5, 1 Bit
   +0x0ac bHIGHDPI_UNAWARE_Unused : Pos 6, 1 Bit
   +0x0ac bVerticallyMaximizedLeft : Pos 7, 1 Bit
   +0x0ac bVerticallyMaximizedRight : Pos 8, 1 Bit
   +0x0ac bHasOverlay      : Pos 9, 1 Bit
   +0x0ac bConsoleWindow   : Pos 10, 1 Bit
   +0x0ac bChildNoActivate : Pos 11, 1 Bit
 
 kd> dt win32k!tagCLS
   +0x000 pclsNext         : Ptr32 tagCLS
   +0x004 atomClassName    : Uint2B
   +0x006 atomNVClassName  : Uint2B
   +0x008 fnid             : Uint2B
   +0x00c rpdeskParent     : Ptr32 tagDESKTOP
   +0x010 pdce             : Ptr32 tagDCE
   +0x014 hTaskWow         : Uint2B
   +0x016 CSF_flags        : Uint2B
   +0x018 lpszClientAnsiMenuName : Ptr32 Char
   +0x01c lpszClientUnicodeMenuName : Ptr32 Uint2B
   +0x020 spcpdFirst       : Ptr32 _CALLPROCDATA
   +0x024 pclsBase         : Ptr32 tagCLS
   +0x028 pclsClone        : Ptr32 tagCLS
   +0x02c cWndReferenceCount : Int4B
   +0x030 style            : Uint4B
   +0x034 lpfnWndProc      : Ptr32     long 
   +0x038 cbclsExtra       : Int4B
   +0x03c cbwndExtra       : Int4B
   +0x040 hModule          : Ptr32 Void
   +0x044 spicn            : Ptr32 tagCURSOR
   +0x048 spcur            : Ptr32 tagCURSOR
   +0x04c hbrBackground    : Ptr32 HBRUSH__
   +0x050 lpszMenuName     : Ptr32 Uint2B
   +0x054 lpszAnsiClassName : Ptr32 Char
   +0x058 spicnSm          : Ptr32 tagCURSOR
 
kd> dt nt!_ETHREAD
   +0x000 Tcb              : _KTHREAD
   +0x200 CreateTime       : _LARGE_INTEGER
   +0x208 ExitTime         : _LARGE_INTEGER
   +0x208 KeyedWaitChain   : _LIST_ENTRY
   +0x210 ExitStatus       : Int4B
   +0x214 PostBlockList    : _LIST_ENTRY
   +0x214 ForwardLinkShadow : Ptr32 Void
   +0x218 StartAddress     : Ptr32 Void
   +0x21c TerminationPort  : Ptr32 _TERMINATION_PORT
   +0x21c ReaperLink       : Ptr32 _ETHREAD
   +0x21c KeyedWaitValue   : Ptr32 Void
   +0x220 ActiveTimerListLock : Uint4B
   +0x224 ActiveTimerListHead : _LIST_ENTRY
   +0x22c Cid              : _CLIENT_ID
   +0x234 KeyedWaitSemaphore : _KSEMAPHORE
   +0x234 AlpcWaitSemaphore : _KSEMAPHORE
   +0x248 ClientSecurity   : _PS_CLIENT_SECURITY_CONTEXT
   +0x24c IrpList          : _LIST_ENTRY
   +0x254 TopLevelIrp      : Uint4B
   +0x258 DeviceToVerify   : Ptr32 _DEVICE_OBJECT
   +0x25c CpuQuotaApc      : Ptr32 _PSP_CPU_QUOTA_APC
   +0x260 Win32StartAddress : Ptr32 Void
   +0x264 LegacyPowerObject : Ptr32 Void
   +0x268 ThreadListEntry  : _LIST_ENTRY
   +0x270 RundownProtect   : _EX_RUNDOWN_REF
   +0x274 ThreadLock       : _EX_PUSH_LOCK
   +0x278 ReadClusterSize  : Uint4B
   +0x27c MmLockOrdering   : Int4B
   +0x280 CrossThreadFlags : Uint4B
   +0x280 Terminated       : Pos 0, 1 Bit
   +0x280 ThreadInserted   : Pos 1, 1 Bit
   +0x280 HideFromDebugger : Pos 2, 1 Bit
   +0x280 ActiveImpersonationInfo : Pos 3, 1 Bit
   +0x280 SystemThread     : Pos 4, 1 Bit
   +0x280 HardErrorsAreDisabled : Pos 5, 1 Bit
   +0x280 BreakOnTermination : Pos 6, 1 Bit
   +0x280 SkipCreationMsg  : Pos 7, 1 Bit
   +0x280 SkipTerminationMsg : Pos 8, 1 Bit
   +0x280 CopyTokenOnOpen  : Pos 9, 1 Bit
   +0x280 ThreadIoPriority : Pos 10, 3 Bits
   +0x280 ThreadPagePriority : Pos 13, 3 Bits
   +0x280 RundownFail      : Pos 16, 1 Bit
   +0x280 NeedsWorkingSetAging : Pos 17, 1 Bit
   +0x284 SameThreadPassiveFlags : Uint4B
   +0x284 ActiveExWorker   : Pos 0, 1 Bit
   +0x284 ExWorkerCanWaitUser : Pos 1, 1 Bit
   +0x284 MemoryMaker      : Pos 2, 1 Bit
   +0x284 ClonedThread     : Pos 3, 1 Bit
   +0x284 KeyedEventInUse  : Pos 4, 1 Bit
   +0x284 RateApcState     : Pos 5, 2 Bits
   +0x284 SelfTerminate    : Pos 7, 1 Bit
   +0x288 SameThreadApcFlags : Uint4B
   +0x288 Spare            : Pos 0, 1 Bit
   +0x288 StartAddressInvalid : Pos 1, 1 Bit
   +0x288 EtwPageFaultCalloutActive : Pos 2, 1 Bit
   +0x288 OwnsProcessWorkingSetExclusive : Pos 3, 1 Bit
   +0x288 OwnsProcessWorkingSetShared : Pos 4, 1 Bit
   +0x288 OwnsSystemCacheWorkingSetExclusive : Pos 5, 1 Bit
   +0x288 OwnsSystemCacheWorkingSetShared : Pos 6, 1 Bit
   +0x288 OwnsSessionWorkingSetExclusive : Pos 7, 1 Bit
   +0x289 OwnsSessionWorkingSetShared : Pos 0, 1 Bit
   +0x289 OwnsProcessAddressSpaceExclusive : Pos 1, 1 Bit
   +0x289 OwnsProcessAddressSpaceShared : Pos 2, 1 Bit
   +0x289 SuppressSymbolLoad : Pos 3, 1 Bit
   +0x289 Prefetching      : Pos 4, 1 Bit
   +0x289 OwnsDynamicMemoryShared : Pos 5, 1 Bit
   +0x289 OwnsChangeControlAreaExclusive : Pos 6, 1 Bit
   +0x289 OwnsChangeControlAreaShared : Pos 7, 1 Bit
   +0x28a OwnsPagedPoolWorkingSetExclusive : Pos 0, 1 Bit
   +0x28a OwnsPagedPoolWorkingSetShared : Pos 1, 1 Bit
   +0x28a OwnsSystemPtesWorkingSetExclusive : Pos 2, 1 Bit
   +0x28a OwnsSystemPtesWorkingSetShared : Pos 3, 1 Bit
   +0x28a TrimTrigger      : Pos 4, 2 Bits
   +0x28a Spare1           : Pos 6, 2 Bits
   +0x28b PriorityRegionActive : UChar
   +0x28c CacheManagerActive : UChar
   +0x28d DisablePageFaultClustering : UChar
   +0x28e ActiveFaultCount : UChar
   +0x28f LockOrderState   : UChar
   +0x290 AlpcMessageId    : Uint4B
   +0x294 AlpcMessage      : Ptr32 Void
   +0x294 AlpcReceiveAttributeSet : Uint4B
   +0x298 AlpcWaitListEntry : _LIST_ENTRY
   +0x2a0 CacheManagerCount : Uint4B
   +0x2a4 IoBoostCount     : Uint4B
   +0x2a8 IrpListLock      : Uint4B
   +0x2ac ReservedForSynchTracking : Ptr32 Void
   +0x2b0 CmCallbackListHead : _SINGLE_LIST_ENTRY
 
kd> dt nt!_KTHREAD
   +0x000 Header           : _DISPATCHER_HEADER
   +0x010 CycleTime        : Uint8B
   +0x018 HighCycleTime    : Uint4B
   +0x020 QuantumTarget    : Uint8B
   +0x028 InitialStack     : Ptr32 Void
   +0x02c StackLimit       : Ptr32 Void
   +0x030 KernelStack      : Ptr32 Void
   +0x034 ThreadLock       : Uint4B
   +0x038 WaitRegister     : _KWAIT_STATUS_REGISTER
   +0x039 Running          : UChar
   +0x03a Alerted          : [2] UChar
   +0x03c KernelStackResident : Pos 0, 1 Bit
   +0x03c ReadyTransition  : Pos 1, 1 Bit
   +0x03c ProcessReadyQueue : Pos 2, 1 Bit
   +0x03c WaitNext         : Pos 3, 1 Bit
   +0x03c SystemAffinityActive : Pos 4, 1 Bit
   +0x03c Alertable        : Pos 5, 1 Bit
   +0x03c GdiFlushActive   : Pos 6, 1 Bit
   +0x03c UserStackWalkActive : Pos 7, 1 Bit
   +0x03c ApcInterruptRequest : Pos 8, 1 Bit
   +0x03c ForceDeferSchedule : Pos 9, 1 Bit
   +0x03c QuantumEndMigrate : Pos 10, 1 Bit
   +0x03c UmsDirectedSwitchEnable : Pos 11, 1 Bit
   +0x03c TimerActive      : Pos 12, 1 Bit
   +0x03c Reserved         : Pos 13, 19 Bits
   +0x03c MiscFlags        : Int4B
   +0x040 ApcState         : _KAPC_STATE
   +0x040 ApcStateFill     : [23] UChar
   +0x057 Priority         : Char
   +0x058 NextProcessor    : Uint4B
   +0x05c DeferredProcessor : Uint4B
   +0x060 ApcQueueLock     : Uint4B
   +0x064 ContextSwitches  : Uint4B
   +0x068 State            : UChar
   +0x069 NpxState         : Char
   +0x06a WaitIrql         : UChar
   +0x06b WaitMode         : Char
   +0x06c WaitStatus       : Int4B
   +0x070 WaitBlockList    : Ptr32 _KWAIT_BLOCK
   +0x074 WaitListEntry    : _LIST_ENTRY
   +0x074 SwapListEntry    : _SINGLE_LIST_ENTRY
   +0x07c Queue            : Ptr32 _KQUEUE
   +0x080 WaitTime         : Uint4B
   +0x084 KernelApcDisable : Int2B
   +0x086 SpecialApcDisable : Int2B
   +0x084 CombinedApcDisable : Uint4B
   +0x088 Teb              : Ptr32 Void
   +0x090 Timer            : _KTIMER
   +0x0b8 AutoAlignment    : Pos 0, 1 Bit
   +0x0b8 DisableBoost     : Pos 1, 1 Bit
   +0x0b8 EtwStackTraceApc1Inserted : Pos 2, 1 Bit
   +0x0b8 EtwStackTraceApc2Inserted : Pos 3, 1 Bit
   +0x0b8 CalloutActive    : Pos 4, 1 Bit
   +0x0b8 ApcQueueable     : Pos 5, 1 Bit
   +0x0b8 EnableStackSwap  : Pos 6, 1 Bit
   +0x0b8 GuiThread        : Pos 7, 1 Bit
   +0x0b8 UmsPerformingSyscall : Pos 8, 1 Bit
   +0x0b8 ReservedFlags    : Pos 9, 23 Bits
   +0x0b8 ThreadFlags      : Int4B
   +0x0bc ServiceTable     : Ptr32 Void
   +0x0c0 WaitBlock        : [4] _KWAIT_BLOCK
   +0x120 QueueListEntry   : _LIST_ENTRY
   +0x128 TrapFrame        : Ptr32 _KTRAP_FRAME
   +0x12c FirstArgument    : Ptr32 Void
   +0x130 CallbackStack    : Ptr32 Void
   +0x130 CallbackDepth    : Uint4B
   +0x134 ApcStateIndex    : UChar
   +0x135 BasePriority     : Char
   +0x136 PriorityDecrement : Char
   +0x136 ForegroundBoost  : Pos 0, 4 Bits
   +0x136 UnusualBoost     : Pos 4, 4 Bits
   +0x137 Preempted        : UChar
   +0x138 AdjustReason     : UChar
   +0x139 AdjustIncrement  : Char
   +0x13a PreviousMode     : Char
   +0x13b Saturation       : Char
   +0x13c SystemCallNumber : Uint4B
   +0x140 FreezeCount      : Uint4B
   +0x144 UserAffinity     : _GROUP_AFFINITY
   +0x150 Process          : Ptr32 _KPROCESS
   +0x154 Affinity         : _GROUP_AFFINITY
   +0x160 IdealProcessor   : Uint4B
   +0x164 UserIdealProcessor : Uint4B
   +0x168 ApcStatePointer  : [2] Ptr32 _KAPC_STATE
   +0x170 SavedApcState    : _KAPC_STATE
   +0x170 SavedApcStateFill : [23] UChar
   +0x187 WaitReason       : UChar
   +0x188 SuspendCount     : Char
   +0x189 Spare1           : Char
   +0x18a OtherPlatformFill : UChar
   +0x18c Win32Thread      : Ptr32 Void
   +0x190 StackBase        : Ptr32 Void
   +0x194 SuspendApc       : _KAPC
   +0x194 SuspendApcFill0  : [1] UChar
   +0x195 ResourceIndex    : UChar
   +0x194 SuspendApcFill1  : [3] UChar
   +0x197 QuantumReset     : UChar
   +0x194 SuspendApcFill2  : [4] UChar
   +0x198 KernelTime       : Uint4B
   +0x194 SuspendApcFill3  : [36] UChar
   +0x1b8 WaitPrcb         : Ptr32 _KPRCB
   +0x194 SuspendApcFill4  : [40] UChar
   +0x1bc LegoData         : Ptr32 Void
   +0x194 SuspendApcFill5  : [47] UChar
   +0x1c3 LargeStack       : UChar
   +0x1c4 UserTime         : Uint4B
   +0x1c8 SuspendSemaphore : _KSEMAPHORE
   +0x1c8 SuspendSemaphorefill : [20] UChar
   +0x1dc SListFaultCount  : Uint4B
   +0x1e0 ThreadListEntry  : _LIST_ENTRY
   +0x1e8 MutantListHead   : _LIST_ENTRY
   +0x1f0 SListFaultAddress : Ptr32 Void
   +0x1f4 ThreadCounters   : Ptr32 _KTHREAD_COUNTERS
   +0x1f8 XStateSave       : Ptr32 _XSTATE_SAVE
 
 0 d bf989dfe     0001 (0001) win32k!sbit_GetBitmap
 1 d bf989504     0001 (0001) win32k!GetSbitComponent
 2 d bf988ac2     0001 (0001) win32k!sfac_GetSbitBitmap
 3 d bf863f56     0001 (0001) win32k!fs_ContourScan+0xde
 4 d bf863c0a     0001 (0001) win32k!fs_ContourScan

bf934fd4 win32k!EngQueryLocalTime = <no type information>
bf938e86 win32k!NtGdiCreateEllipticRgn = <no type information>
bf9ab9f0 win32k!ghwndSwitch = <no type information>
bf924fc9 win32k!SearchAndSetKbdTbl = <no type information>
bf9266fa win32k!xxxUnlatchStickyKeys = <no type information>
bf814ef4 win32k!NtUserInvalidateRect = <no type information>
bf98cf78 win32k!_imp__IoGetStackLimits = <no type information>
bf945860 win32k!vTransparentCopyS32D8 = <no type information>
bf8899ff win32k!xxxMoveThumb = <no type information>
bf84b3ed win32k!KillTooltipTimer = <no type information>
bf8d31db win32k!fsg_CompositeInnerGridFit = <no type information>
